# 3day 빈도 및 교차 데이터 만들기

### tips 데이터셋 읽어들이기

In [2]:
import pandas as pd

In [4]:
import matplotlib as mpl
import matplotlib.pylab as plt
import seaborn as sns

In [6]:
import numpy as np

In [7]:
tips = sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

### 빈도분석

In [12]:
#성별관련 데이터만 추출
tips[["sex"]]

        sex
0    Female
1      Male
2      Male
3      Male
4    Female
..      ...
239    Male
240  Female
241    Male
242    Male
243  Female

[244 rows x 1 columns]

In [14]:
#성별 빈도분석
tips["sex"].value_counts()

Male      157
Female     87
Name: sex, dtype: int64

In [16]:
#요일별 빈도 분석
tips["day"].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [18]:
#시간별 빈도 분석
tips["day"].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [20]:
#흡연자 빈도분석
tips["day"].value_counts()

Sat     87
Sun     76
Thur    62
Fri     19
Name: day, dtype: int64

In [24]:
#월별/성별 고차분석
#판다스라이브러리를 직접 넣어야함
pd.crosstab(tips["sex"],tips["day"])

day     Thur  Fri  Sat  Sun
sex
Male      30   10   59   58
Female    32    9   28   18

In [26]:
#성별/월별 교차분석 총괄표
pd.crosstab(tips["sex"],tips["day"], margins = True)

day     Thur  Fri  Sat  Sun  All
sex
Male      30   10   59   58  157
Female    32    9   28   18   87
All       62   19   87   76  244

In [32]:
#빈도비율확인
pd.crosstab(tips["sex"]
            , tips["day"]).apply(
                lambda r: r/len(tips)
                ,axis = 1
            )

#람다표현식
#일반적으로 apply함수 이용. 복잡한 함수식을 간략화함

day         Thur       Fri       Sat       Sun
sex
Male    0.122951  0.040984  0.241803  0.237705
Female  0.131148  0.036885  0.114754  0.073770

In [36]:
#tips안에 있는 모든 데이터 타입 조회
tips.dtypes
#category: 범주형 데이터
#int 64/float64 : 연속형 데이터(숫자값이용) => 기초 통계 데이터 조회

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

In [40]:
#기초 통계데이터 조회tips.describe()
tips.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000